luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxHssl_regdef.h
/** \brief  Configuration Register */
typedef struct _Ifx_HSSL_CFG_Bits
{
    unsigned int PREDIV:14;                 /**< \brief [13:0] Global Predivider (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SMT:1;                     /**< \brief [16:16] Streaming Mode Transmitter (rw) */
    unsigned int SMR:1;                     /**< \brief [17:17] Streaming Mode Receiver (rw) */
    unsigned int SCM:1;                     /**< \brief [18:18] Streaming Channel Mode (rw) */
    unsigned int CCC:1;                     /**< \brief [19:19] Channel Code Control (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_HSSL_CFG_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_HSSL_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_HSSL_CLC_Bits;

/** \brief  CRC Control Register */
typedef struct _Ifx_HSSL_CRC_Bits
{
    unsigned int XORMASK:16;                /**< \brief [15:0] Value to be XORed with the Calculated CRC (rw) */
    unsigned int XEN:1;                     /**< \brief [16:16] Enable the Error Injection via XORMASK (rw) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_HSSL_CRC_Bits;

/** \brief  Initiator Control Data Register */
typedef struct _Ifx_HSSL_I_ICON_Bits
{
    unsigned int IDQ:1;                     /**< \brief [0:0] Read ID Request (w) */
    unsigned int TQ:1;                      /**< \brief [1:1] Trigger Request (w) */
    unsigned int LETT:3;                    /**< \brief [4:2] Last Error Transaction Tag (rh) */
    unsigned int CETT:3;                    /**< \brief [7:5] Currently Expected Transaction Tag (rh) */
    unsigned int TOCV:8;                    /**< \brief [15:8] Time Out Current Value (rh) */
    unsigned int DATLEN:2;                  /**< \brief [17:16] Data Length (rw) */
    unsigned int RWT:2;                     /**< \brief [19:18] Read Write Trigger Command Type (rw) */
    unsigned int BSY:1;                     /**< \brief [20:20] Channel Busy (rh) */
    unsigned int ITTAG:3;                   /**< \brief [23:21] Initiator Transaction Tag (rh) */
    unsigned int TOREL:8;                   /**< \brief [31:24] Time Out Reload Value (rw) */
} Ifx_HSSL_I_ICON_Bits;

/** \brief  Initiator Read Data Register */
typedef struct _Ifx_HSSL_I_IRD_Bits
{
    unsigned int DATA:32;                   /**< \brief [31:0] Data Delivered by a Read Response Frame (rh) */
} Ifx_HSSL_I_IRD_Bits;

/** \brief  Initiator Read Write Address Register */
typedef struct _Ifx_HSSL_I_IRWA_Bits
{
    unsigned int ADDRESS:32;                /**< \brief [31:0] Address Part of the Payload of a Write Frame (rw) */
} Ifx_HSSL_I_IRWA_Bits;

/** \brief  Initiator Write Data Register */
typedef struct _Ifx_HSSL_I_IWD_Bits
{
    unsigned int DATA:32;                   /**< \brief [31:0] Data Part of the Payload of a Write Frame (rw) */
} Ifx_HSSL_I_IWD_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_HSSL_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_HSSL_ID_Bits;

/** \brief  Initiator Stream Current Address Register */
typedef struct _Ifx_HSSL_IS_CA_Bits
{
    unsigned int reserved_0:5;              /**< \brief \internal Reserved */
    unsigned int CURR:27;                   /**< \brief [31:5] Address of the Memory Location for the Current Transfer (rh) */
} Ifx_HSSL_IS_CA_Bits;

/** \brief  Initiator Stream Frame Count Register */
typedef struct _Ifx_HSSL_IS_FC_Bits
{
    unsigned int RELCOUNT:16;               /**< \brief [15:0] Reload Count Number (rw) */
    unsigned int CURCOUNT:16;               /**< \brief [31:16] Current Count Number (rh) */
} Ifx_HSSL_IS_FC_Bits;

/** \brief  Initiator Stream Start Address Register */
typedef struct _Ifx_HSSL_ISSA_Bits
{
    unsigned int reserved_0:5;              /**< \brief \internal Reserved */
    unsigned int START:27;                  /**< \brief [31:5] Start Address for the Memory Range (rw) */
} Ifx_HSSL_ISSA_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_HSSL_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_HSSL_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_HSSL_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_HSSL_KRST1_Bits;

/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_HSSL_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_HSSL_KRSTCLR_Bits;

/** \brief  Miscellaneous Flags Register */
typedef struct _Ifx_HSSL_MFLAGS_Bits
{
    unsigned int NACK:4;                    /**< \brief [3:0] Not Acknowledge Error - Target Error (rh) */
    unsigned int TTE:4;                     /**< \brief [7:4] Transaction Tag Error (rh) */
    unsigned int TIMEOUT:4;                 /**< \brief [11:8] Timeout Error (rh) */
    unsigned int UNEXPECTED:4;              /**< \brief [15:12] Unexpected Type of Frame Error (rh) */
    unsigned int reserved_16:2;             /**< \brief \internal Reserved */
    unsigned int TMB:1;                     /**< \brief [18:18] Target Memory Block (rh) */
    unsigned int IMB:1;                     /**< \brief [19:19] Initiator Memory Block (rh) */
    unsigned int ISB:1;                     /**< \brief [20:20] Initiator Stream Block Request (rh) */
    unsigned int MAV:1;                     /**< \brief [21:21] Memory Access Violation (rh) */
    unsigned int SRIE:1;                    /**< \brief [22:22] SRI/SPB Bus Access Error (rh) */
    unsigned int PIE1:1;                    /**< \brief [23:23] PHY Inconsistency Error 1 (rh) */
    unsigned int PIE2:1;                    /**< \brief [24:24] PHY Inconsistency Error 2 (rh) */
    unsigned int CRCE:1;                    /**< \brief [25:25] CRC Error (rh) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int TSE:1;                     /**< \brief [28:28] Target Stream Enable (rh) */
    unsigned int TEI:1;                     /**< \brief [29:29] Transmit Enable Input (rh) */
    unsigned int TEO:1;                     /**< \brief [30:30] Transmit Enable Output (rh) */
    unsigned int INI:1;                     /**< \brief [31:31] Initialize Mode (rh) */
} Ifx_HSSL_MFLAGS_Bits;

/** \brief  Miscellaneous Flags Clear Register */
typedef struct _Ifx_HSSL_MFLAGSCL_Bits
{
    unsigned int NACKC:4;                   /**< \brief [3:0] NACK Flags Clear (w) */
    unsigned int TTEC:4;                    /**< \brief [7:4] Transaction Tag Error Flags Clear (w) */
    unsigned int TIMEOUTC:4;                /**< \brief [11:8] Timeout Error Flags Clear (w) */
    unsigned int UNEXPECTEDC:4;             /**< \brief [15:12] Unexpected Error Flags Clear (w) */
    unsigned int reserved_16:2;             /**< \brief \internal Reserved */
    unsigned int TMBC:1;                    /**< \brief [18:18] Target Memory Block Flag Clear (w) */
    unsigned int IMBC:1;                    /**< \brief [19:19] Initiator Memory Block Flag Clear (w) */
    unsigned int ISBC:1;                    /**< \brief [20:20] Initiator Stream Block Request Clear (w) */
    unsigned int MAVC:1;                    /**< \brief [21:21] MAV Flag Clear (w) */
    unsigned int SRIEC:1;                   /**< \brief [22:22] SRI/SPB Bus Access Error Flag Clear (w) */
    unsigned int PIE1C:1;                   /**< \brief [23:23] PIE1 Error Flag Clear (w) */
    unsigned int PIE2C:1;                   /**< \brief [24:24] PIE2 Error Flag Clear (w) */
    unsigned int CRCEC:1;                   /**< \brief [25:25] CRC Error Flag Clear (w) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int TSEC:1;                    /**< \brief [28:28] Target Stream Enable Flag Clear (w) */
    unsigned int reserved_29:1;             /**< \brief \internal Reserved */
    unsigned int TEOC:1;                    /**< \brief [30:30] Transmit Enable Flag Clear (w) */
    unsigned int INIC:1;                    /**< \brief [31:31] Initialize Mode Flag Clear (w) */
} Ifx_HSSL_MFLAGSCL_Bits;

/** \brief  Flags Enable Register */
typedef struct _Ifx_HSSL_MFLAGSEN_Bits
{
    unsigned int NACKEN:4;                  /**< \brief [3:0] Not Acknowledge Error Enable Bits (rw) */
    unsigned int TTEEN:4;                   /**< \brief [7:4] Transaction Tag Error Enable Bits (rw) */
    unsigned int TIMEOUTEN:4;               /**< \brief [11:8] Timeout Error Enable Bits (rw) */
    unsigned int UNEXPECTEDEN:4;            /**< \brief [15:12] Unexpected Error Enable Bits (rw) */
    unsigned int reserved_16:5;             /**< \brief \internal Reserved */
    unsigned int MAVEN:1;                   /**< \brief [21:21] MAV Enable Bit (rw) */
    unsigned int SRIEEN:1;                  /**< \brief [22:22] SRI/SPB Bus Access Error Enable Bit (rw) */
    unsigned int PIE1EN:1;                  /**< \brief [23:23] PIE1 Error Enable Bit (rw) */
    unsigned int PIE2EN:1;                  /**< \brief [24:24] PIE2 Error Enable Bit (rw) */
    unsigned int CRCEEN:1;                  /**< \brief [25:25] CRC Error Enable Bit (rw) */
    unsigned int reserved_26:3;             /**< \brief \internal Reserved */
    unsigned int TEIEN:1;                   /**< \brief [29:29] TEI Enable Bit (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_HSSL_MFLAGSEN_Bits;

