luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxHssl_regdef.h
/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_HSSL_ACCEN1;

/** \brief  Access Rules Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_AR_Bits B;                     /**< \brief Bitfield access */
} Ifx_HSSL_AR;

/** \brief  Access Window End Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_AW_AWEND_Bits B;               /**< \brief Bitfield access */
} Ifx_HSSL_AW_AWEND;

/** \brief  Access Window Start Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_AW_AWSTART_Bits B;             /**< \brief Bitfield access */
} Ifx_HSSL_AW_AWSTART;

/** \brief  Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_CFG_Bits B;                    /**< \brief Bitfield access */
} Ifx_HSSL_CFG;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_CLC_Bits B;                    /**< \brief Bitfield access */
} Ifx_HSSL_CLC;

/** \brief  CRC Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_CRC_Bits B;                    /**< \brief Bitfield access */
} Ifx_HSSL_CRC;

/** \brief  Initiator Control Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_I_ICON_Bits B;                 /**< \brief Bitfield access */
} Ifx_HSSL_I_ICON;

/** \brief  Initiator Read Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_I_IRD_Bits B;                  /**< \brief Bitfield access */
} Ifx_HSSL_I_IRD;

/** \brief  Initiator Read Write Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_I_IRWA_Bits B;                 /**< \brief Bitfield access */
} Ifx_HSSL_I_IRWA;

/** \brief  Initiator Write Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_I_IWD_Bits B;                  /**< \brief Bitfield access */
} Ifx_HSSL_I_IWD;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_ID_Bits B;                     /**< \brief Bitfield access */
} Ifx_HSSL_ID;

/** \brief  Initiator Stream Current Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_IS_CA_Bits B;                  /**< \brief Bitfield access */
} Ifx_HSSL_IS_CA;

/** \brief  Initiator Stream Frame Count Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_IS_FC_Bits B;                  /**< \brief Bitfield access */
} Ifx_HSSL_IS_FC;

/** \brief  Initiator Stream Start Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_ISSA_Bits B;                   /**< \brief Bitfield access */
} Ifx_HSSL_ISSA;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_KRST0_Bits B;                  /**< \brief Bitfield access */
} Ifx_HSSL_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_KRST1_Bits B;                  /**< \brief Bitfield access */
} Ifx_HSSL_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_KRSTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_HSSL_KRSTCLR;

/** \brief  Miscellaneous Flags Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_MFLAGS_Bits B;                 /**< \brief Bitfield access */
} Ifx_HSSL_MFLAGS;

/** \brief  Miscellaneous Flags Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_MFLAGSCL_Bits B;               /**< \brief Bitfield access */
} Ifx_HSSL_MFLAGSCL;

/** \brief  Flags Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSSL_MFLAGSEN_Bits B;               /**< \brief Bitfield access */
} Ifx_HSSL_MFLAGSEN;

